app/controllers/posts_controller.rb

  def index
  	@posts = Post.all
---
SELECT `posts`.* FROM `posts`

  def create
  	@post = Post.new(permit_post)
  	if @post.save
---
INSERT INTO `posts` (`image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `description`, `created_at`, `updated_at`) VALUES ('13537812_1206461519404020_4629249675741428187_n.png', 'image/png', 539579, '2016-06-29 17:43:45', 'safasfasfaf', '2016-06-29 17:43:46', '2016-06-29 17:43:46')

  def show
  	@post = Post.find(params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1